<%@ page language="java" contentType="text/html; charset=UTF-8"%>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>travel</title>
<%String context = request.getContextPath();%>
<link href="<%=context%>/resources/css/style.css" rel="stylesheet" type="text/css" />
<script type="text/javascript" src="<%=context%>/js/esl.js"></script>
<script type="text/javascript" src="<%=context%>/js/jquery.js"></script>
<script type="text/javascript">
	var transTimes = <%=request.getAttribute("transTimes")%>;
	var areaNm = <%=request.getAttribute("areaNm")%>;
	var areaLegend = <%=request.getAttribute("areaLegend")%>;
	var areaRank = <%=request.getAttribute("areaRank")%>;
	var bankNm = <%=request.getAttribute("bankNm")%>;
	var bankLegend = <%=request.getAttribute("bankLegend")%>;
	var bankRank = <%=request.getAttribute("bankRank")%>;
	var legendNm = <%=request.getAttribute("legendNm")%>;
	var maxTimes = <%=request.getAttribute("maxTimes")%>;
	var seriesNm = <%=request.getAttribute("seriesNm")%>;
	var markLineData = <%=request.getAttribute("markLineData")%>;
	var markPointData = <%=request.getAttribute("markPointData")%>;
	var cardLvl = <%=request.getAttribute("cardLvl")%>;

	//商旅评分
	function openRank() {
		parent.parent.setAreaBank(areaNm, areaLegend.toString(), 
				areaRank.toString(), bankNm, bankLegend.toString(), bankRank.toString());
		parent.parent.showRankModal();
	}
	//商旅交易
	function openTrade() {
		parent.parent.setTransTimes(transTimes.toString());
		parent.parent.showTradeModal();
	}
	
	function init() {
		document.getElementById("yearSpan").innerHTML = <%=request.getAttribute("yearSpan")%>;
		document.getElementById("trvlVal").innerHTML = <%=request.getAttribute("trvlVal")%>;
		document.getElementById("trvlRank").innerHTML = <%=request.getAttribute("trvlRank")%>;
		document.getElementById("trvlBtNum").innerHTML = <%=request.getAttribute("trvlBtNum")%>;
		document.getElementById("trvlTransTimes").innerHTML = <%=request.getAttribute("trvlTransTimes")%>;
		document.getElementById("trvlTransSum").innerHTML = <%=request.getAttribute("trvlTransSum")%>;
		document.getElementById("crossTrvlTimes").innerHTML = <%=request.getAttribute("crossTrvlTimes")%>;
		document.getElementById("htlLvl").innerHTML = <%=request.getAttribute("htlLvl")%>;
		document.getElementById("htlTimes").innerHTML = <%=request.getAttribute("htlTimes")%>;
		document.getElementById("htlSum").innerHTML = <%=request.getAttribute("htlSum")%>;
		document.getElementById("htlLoyalty").innerHTML = <%=request.getAttribute("htlLoyalty")%>;
		document.getElementById("cityNum").innerHTML = <%=request.getAttribute("cityNum")%>;
		document.getElementById("provinceNum").innerHTML = <%=request.getAttribute("provinceNum")%>;
		document.getElementById("crossTimes").innerHTML = <%=request.getAttribute("crossTimes")%>;
		document.getElementById("crossSum").innerHTML = <%=request.getAttribute("crossSum")%>;
		document.getElementById("crossAreaNm").innerHTML = <%=request.getAttribute("crossAreaNm")%>;
		document.getElementById("trvlLvlNm").innerHTML = <%=request.getAttribute("trvlLvlNm")%>;
		setCardImg();
		setCardTxt();
	}
	
	function load() {
		if(areaNm == null || areaNm =="null") {
			hidden();
		} else
		{
			init();
			show();
			draw();
		}
	}
	
	function draw() {
		config();
		drawMchntMigrate(legendNm, maxTimes, seriesNm, markLineData, markPointData);
	}
	
	function hidden() {
		document.getElementById("shanglv_box").style.display = "none";   
	}

	function show() {
		document.getElementById("shanglv_box").style.display = "block"; 
	}
	
	function config() {
		require.config({
			paths : {
			echarts : '<%=context%>/js/echarts-map',  			
			'echarts/chart/map': '<%=context%>/js/echarts-map'
			}
		});
	}

	function drawMchntMigrate(legendNm, maxTimes, seriesNm, markLineData, markPointData) {
		require([ 'echarts', 'echarts/chart/map' ], function(ec) {
			var mmChart = ec.init(document.getElementById('mchntMigrate'));
			mmOption = {
					backgroundColor : '#1b1b1b',
					color : [ 'gold', 'aqua', 'lime' ],
					title : {
						text : '国内商旅迁徙图',
						x : 'center',
						textStyle : {color : '#fff'}
					},
					tooltip : {
						trigger : 'item',
						formatter : function(v) {
							return v[1].replace(':', ' > ');
						}
					},
					legend : {
						orient : 'vertical',
						x : 'left',
						data : legendNm,
						selectedMode : 'single',					
						textStyle : {color : '#fff'}
					},
					toolbox : {
						show : true,
						orient : 'vertical',
						x : 'right',
						y : 'center',
						feature : {
							mark : {show : true},
							dataView : {show : true,readOnly : false},
							restore : {show : true},
							saveAsImage : {show : true}
						}
					},
					dataRange : {
						min : 0,
						max : maxTimes,
						calculable : true,
						color : [ 'red', 'orange', 'yellow', 'lightgreen' ],
						textStyle : {color : '#fff'}
					},
					series : [ {
						name : '全国',
						type : 'map',
						roam : true,
						hoverable : false,
						mapType : 'china',
						itemStyle : {
							normal : {
								borderColor : 'rgba(100,149,237,1)',
								borderWidth : 0.5,
								areaStyle : {
									color : '#1b1b1b'
								}
							}
						},
						data : [],
						markLine : {
							smooth : true,
							symbol : [ 'none', 'circle' ],
							symbolSize : 1,
							itemStyle : {
								normal : {
									color : '#fff',
									borderWidth : 1,
									borderColor : 'rgba(30,144,255,0.5)'
								}
							},
							data : [],
				        },
						geoCoord : {
							'北京':[116.39564503788,39.92998577808],
				            '天津':[117.21081309155,39.14392990331],
				            '河北':[117.22029676508,39.173148933924],
				            '石家庄':[114.52208184421,38.048958314615],
				            '唐山':[118.18345059773,39.650530922537],
				            '秦皇岛':[119.60436761612,39.945461565898],
				            '邯郸':[114.48269393234,36.609307928471],
				            '邢台':[114.52048681294,37.069531196912],
				            '保定':[115.49481016908,38.886564548027],
				            '张家口':[114.89378153033,40.811188491103],
				            '承德':[117.93382245584,40.992521052457],
				            '沧州':[116.86380647644,38.297615350326],
				            '廊坊':[116.70360222264,39.518610625085],
				            '衡水':[115.68622865291,37.746929045857],
				            '山西':[112.51549586384,37.866565990509],
				            '太原':[112.55086358906,37.890277053968],
				            '大同':[124.69907739268,46.070051001663],
				            '阳泉':[113.56923760163,37.869529493223],
				            '长治':[113.12029208573,36.201664385743],
				            '晋城':[112.86733275751,35.499834467226],
				            '朔州':[112.47992772666,39.337671966221],
				            '忻州':[112.72793882881,38.461030572959],
				            '吕梁':[111.14315660235,37.527316096963],
				            '晋中':[112.73851439992,37.693361526798],
				            '临汾':[111.53878759641,36.099745443585],
				            '运城':[111.00685365308,35.038859479812],
				            '内蒙古':[114.41586754817,43.468238221949],
				            '呼和浩特':[111.66035052005,40.828318873082],
				            '包头':[109.84623853249,40.647119425709],
				            '乌海':[106.83199909716,39.683177006785],
				            '赤峰':[118.93076119217,42.297112320317],
				            '呼伦贝尔':[119.760821794,49.201636054604],
				            '根河':[121.79771324217,51.37592516127],
				            '通辽':[122.26036326322,43.633756072996],
				            '霍林郭勒':[119.57974844022,45.52810605633],
				            '乌兰察布':[113.11284639068,41.022362946751],
				            '鄂尔多斯':[109.99370625145,39.816489560602],
				            '巴彦淖尔':[107.42380671968,40.769179902429],
				            '阿拉善':[113.64750947597,41.207067970754],
				            '辽宁':[122.75359155772,41.621600105958],
				            '沈阳':[123.43279092161,41.808644783516],
				            '大连':[121.59347778144,38.948709938304],
				            '鞍山':[123.00776332888,41.118743682153],
				            '抚顺':[123.92981976705,41.877303829591],
				            '本溪':[123.77806236979,41.325837626649],
				            '丹东':[124.33854311477,40.129022826638],
				            '锦州':[121.14774873824,41.130878875917],
				            '营口':[122.23339137079,40.668651066474],
				            '阜新':[121.66082212857,42.01925010706],
				            '辽阳':[123.17245120515,41.273339265569],
				            '盘锦':[122.07322781023,41.141248022956],
				            '铁岭':[123.85484961462,42.299757012125],
				            '朝阳':[125.27822648218,43.689108619451],
				            '葫芦岛':[120.86075764476,40.743029881318],
				            '吉林':[126.56454398883,43.871988334359],
				            '长春':[125.3136424272,43.898337607098],
				            '四平':[124.39138207368,43.175524701126],
				            '辽源':[125.13368605218,42.923302619054],
				            '通化':[125.94265013851,41.736397129868],
				            '白山':[126.43579767535,41.945859397018],
				            '白城':[122.8407766791,45.621086275219],
				            '延边朝鲜族':[128.919986914,43.112685839285],
				            '松原':[124.83299453234,45.136048970084],
				            '黑龙江':[128.04741371499,47.356591643111],
				            '哈尔滨':[126.65771685545,45.773224633239],
				            '齐齐哈尔':[123.98728894217,47.347699813366],
				            '鸡西':[130.94176727325,45.321539886551],
				            '鹤岗':[130.29247205063,47.338665903727],
				            '双鸭山':[131.17140173958,46.655102062482],
				            '大庆':[125.02183973021,46.596709020008],
				            '伊春':[128.90057964259,47.741959238189],
				            '佳木斯':[130.28473458595,46.81377960474],
				            '七台河':[131.01904804712,45.77500536864],
				            '牡丹江':[129.60803539564,44.588521152783],
				            '绥化':[126.98909457163,46.646063926997],
				            '黑河':[127.50083029524,50.250690090738],
				            '大兴安岭':[124.19610419017,51.991788968014],
				            '上海':[121.48789948569,31.249161710015],
				            '江苏':[119.36848893836,33.013797169954],
				            '南京':[118.77807440803,32.057235501806],
				            '无锡':[120.30545590054,31.570037451923],
				            '徐州':[117.18810662318,34.271553431092],
				            '常州':[119.98186101346,31.771396744684],
				            '苏州':[120.61990711549,31.317987367952],
				            '南通':[120.87380095093,32.014664540823],
				            '连云港':[119.17387221742,34.60154896701],
				            '淮安':[119.03018636466,33.606512739276],
				            '盐城':[120.14887181794,33.379861877121],
				            '扬州':[119.42777755117,32.408505254568],
				            '镇江':[119.45583540513,32.204409443599],
				            '泰州':[119.91960601619,32.47605327483],
				            '宿迁':[118.29689337855,33.952049733709],
				            '浙江':[119.95720242066,29.159494120761],
				            '杭州':[120.21937541572,30.259244461536],
				            '宁波':[121.57900597259,29.885258965918],
				            '温州':[120.69063473371,28.002837594041],
				            '嘉兴':[120.76042769896,30.773992239582],
				            '湖州':[120.13724316328,30.877925155691],
				            '绍兴':[120.59246738555,30.002364580528],
				            '金华':[119.65257570368,29.102899105391],
				            '衢州':[118.87584165151,28.956910447536],
				            '舟山':[122.16987209835,30.036010302554],
				            '丽水':[119.92957584319,28.456299552144],
				            '台州':[121.44061293594,28.668283285674],
				            '安徽':[117.21600520757,31.859252417079],
				            '合肥':[117.28269909168,31.866942260687],
				            '芜湖':[118.38410842323,31.366019787543],
				            '蚌埠':[117.35707986588,32.929498906698],
				            '淮南':[117.01863886329,32.642811823748],
				            '马鞍山':[118.51588184662,31.68852815888],
				            '淮北':[116.79144742863,33.960023305364],
				            '铜陵':[117.81942872881,30.940929694666],
				            '安庆':[117.05873877211,30.537897817381],
				            '黄山':[118.07754612726,30.27774589512],
				            '阜阳':[115.82093225905,32.90121133057],
				            '宿州':[116.98869241183,33.636772385781],
				            '滁州':[118.32457035098,32.317350595384],
				            '六安':[116.50525268298,31.755558355198],
				            '宣城':[118.75209631098,30.951642354296],
				            '巢湖':[117.88049041703,31.608732547546],
				            '池州':[117.49447677159,30.660019248161],
				            '亳州':[115.78792824512,33.871210565302],
				            '福建':[117.98494311991,26.050118295661],
				            '福州':[119.33022110713,26.047125496573],
				            '厦门':[118.10388604566,24.489230612469],
				            '莆田':[119.07773096396,25.448450136734],
				            '三明':[117.64219393404,26.270835279362],
				            '泉州':[118.60036234323,24.901652383991],
				            '漳州':[117.67620467895,24.517064779808],
				            '南平':[118.18188294866,26.643626474198],
				            '宁德':[119.54208214972,26.656527419159],
				            '龙岩':[117.01799673877,25.078685433515],
				            '江西':[115.6760823667,27.757258443441],
				            '南昌':[115.89352754584,28.689578000141],
				            '景德镇':[117.18652262527,29.303562768448],
				            '萍乡':[113.85991703301,27.639544222952],
				            '九江':[115.99984802155,29.719639526122],
				            '新余':[114.94711741679,27.822321558629],
				            '鹰潭':[117.03545018601,28.241309597182],
				            '赣州':[114.93590907928,25.845295536347],
				            '宜春':[114.40003867156,27.811129895843],
				            '上饶':[117.95546387715,28.457622553937],
				            '吉安':[114.99203871092,27.113847650157],
				            '抚州':[116.36091886693,27.95454517027],
				            '山东':[118.52766339288,36.099289929728],
				            '济南':[117.02496706629,36.682784727161],
				            '青岛':[120.38442818368,36.105214901274],
				            '淄博':[118.05913427787,36.804684854212],
				            '枣庄':[117.2793053833,34.807883078386],
				            '东营':[118.61264305188,37.408666288041],
				            '烟台':[121.30955503009,37.53656156286],
				            '潍坊':[119.14263382297,36.716114873051],
				            '济宁':[116.60079762482,35.402121664331],
				            '泰安':[117.08941491714,36.188077758948],
				            '威海':[122.09395836581,37.528787081251],
				            '滨州':[117.96829241453,37.405313941826],
				            '德州':[116.32816136356,37.460825926305],
				            '聊城':[115.98686913929,36.455828514728],
				            '临沂':[118.34076823661,35.072409074391],
				            '荷泽':[119.29387934926,26.071112134561],
				            '日照':[119.50717994299,35.420225193144],
				            '莱芜':[117.68466691247,36.233654133647],
				            '河南':[101.55630729533,34.511389737869],
				            '郑州':[113.64964384986,34.75661006414],
				            '开封':[114.35164211776,34.801854175837],
				            '洛阳':[112.44752476895,34.657367817651],
				            '平顶山':[113.30084897798,33.745301456524],
				            '安阳':[114.35180650767,36.110266722181],
				            '鹤壁':[114.29776983802,35.755425874224],
				            '新乡':[113.91269016082,35.307257557661],
				            '焦作':[113.21183588499,35.234607554986],
				            '濮阳':[115.02662744067,35.753297888208],
				            '许昌':[113.83531245979,34.026739588655],
				            '漯河':[114.04606140023,33.576278688483],
				            '三门峡':[111.18126209327,34.78331994105],
				            '商丘':[115.64188568785,34.438588640246],
				            '周口':[114.6541019423,33.623740818141],
				            '驻马店':[114.04915354746,32.983158154093],
				            '南阳':[112.54284190051,33.011419569116],
				            '信阳':[114.08549099347,32.128582307512],
				            '湖北':[112.41056219213,31.20931625014],
				            '武汉':[114.31620010268,30.581084126921],
				            '黄石':[115.05068316392,30.216127127714],
				            '十堰':[110.80122891676,32.636994339468],
				            '宜昌':[111.31098109196,30.732757818026],
				            '随州':[113.37935836429,31.717857608189],
				            '襄阳':[112.25009284837,32.229168591538],
				            '鄂州':[114.89559404136,30.384439322752],
				            '荆门':[112.21733029897,31.042611202949],
				            '黄冈':[114.90661804658,30.446108937901],
				            '孝感':[113.93573439207,30.927954784201],
				            '咸宁':[114.30006059206,29.880656757728],
				            '荆州':[112.09985718065,30.396103360853],
				            '恩施土家族苗族':[114.31965336872,30.633465192056],
				            '湖南':[111.72066354648,27.695864052356],
				            '长沙':[112.97935278765,28.213478230853],
				            '株州':[113.13169534107,27.827432927663],
				            '湘潭':[112.93555563303,27.835095052979],
				            '衡阳':[112.58381881072,26.898164415358],
				            '邵阳':[111.46152540355,27.236811244922],
				            '岳阳':[113.14619551912,29.378007075474],
				            '常德':[111.65371813684,29.012148855181],
				            '张家界':[110.48162015697,29.12488935322],
				            '益阳':[112.36654664523,28.588087779887],
				            '娄底':[111.99639635657,27.741073302349],
				            '郴州':[113.0377044678,25.782263975739],
				            '永州':[111.61464768616,26.435971646759],
				            '怀化':[109.98695879585,27.557482901173],
				            '湘西土家族苗族':[109.74574580039,28.317950793674],
				            '广东':[113.39481755876,23.408003729025],
				            '广州':[113.30764967515,23.120049102076],
				            '韶关':[113.59446110744,24.802960311892],
				            '深圳':[114.02597365732,22.546053546205],
				            '珠海':[113.56244702619,22.256914646126],
				            '汕头':[116.72865028834,23.383908453269],
				            '佛山':[113.13402563539,23.035094840514],
				            '江门':[113.07812534115,22.575116783451],
				            '湛江':[110.36506726285,21.257463103764],
				            '茂名':[110.93124533068,21.668225718822],
				            '肇庆':[112.47965336992,23.078663282929],
				            '惠州':[114.41065807997,23.113539852408],
				            '梅州':[116.12640309837,24.304570606031],
				            '汕尾':[115.3729242894,22.778730500164],
				            '河源':[114.71372147587,23.757250850469],
				            '阳江':[111.97700975587,21.871517304519],
				            '清远':[113.04077334891,23.698468550422],
				            '东莞':[113.76343399076,23.043023815368],
				            '中山':[121.67796628923,38.900436431992],
				            '潮州':[116.63007599086,23.661811676517],
				            '揭阳':[116.37950085538,23.547999466926],
				            '云浮':[112.05094595865,22.937975685537],
				            '广西':[108.92427442706,23.552254688119],
				            '南宁':[108.29723355587,22.806492935603],
				            '柳州':[109.42240181015,24.329053352467],
				            '桂林':[110.26092014748,25.262901245955],
				            '梧州':[111.30547195007,23.485394636734],
				            '北海':[109.12262791919,21.47271823501],
				            '玉林':[110.15167631614,22.643973608377],
				            '百色':[106.63182140365,23.90151236791],
				            '河池':[108.06994770937,24.699520782873],
				            '钦州':[108.63879805642,21.973350465313],
				            '防城港':[108.35179115286,21.617398470472],
				            '贵港':[109.61370755658,23.103373164409],
				            '贺州':[111.55259417884,24.411053547113],
				            '来宾':[109.23181650474,23.741165926515],
				            '崇左':[107.35732203837,22.415455296546],
				            '海南':[106.92539717866,39.296209479392],
				            '海口':[110.33080184834,20.022071276952],
				            '三亚':[109.52277128136,18.257775914897],
				            '四川':[102.8991597236,30.367480937958],
				            '成都':[104.0679234633,30.67994284542],
				            '自贡':[104.77607133936,29.359156889476],
				            '攀枝花':[101.72242315249,26.587571257109],
				            '泸州':[105.44397028921,28.89592980386],
				            '德阳':[104.40239781824,31.131139652701],
				            '绵阳':[104.70551897529,31.504701258061],
				            '广元':[105.81968694,32.441040158428],
				            '遂宁':[105.56488779226,30.55749135038],
				            '内江':[105.07305599171,29.599461534775],
				            '乐山':[103.76082423877,29.600957611095],
				            '眉山':[103.84142956287,30.061115079945],
				            '广安':[106.75891196362,30.599249987199],
				            '宜宾':[104.63301906153,28.769674796266],
				            '南充':[106.10555398379,30.800965168237],
				            '达州':[107.49497344659,31.214198858945],
				            '雅安':[103.00935646635,29.999716337066],
				            '阿坝藏族羌族':[102.22856468921,31.905762858339],
				            '甘孜藏族':[101.96923206306,30.055144114356],
				            '凉山彝族':[102.2595908032,27.892392903666],
				            '巴中':[106.75791584175,31.86918915916],
				            '资阳':[112.34312135279,28.694069428897],
				            '重庆':[106.53063501341,29.544606108886],
				            '贵州':[106.7349961033,26.902825927797],
				            '贵阳':[106.70917709618,26.629906741441],
				            '六盘水':[104.85208676007,26.591866060319],
				            '遵义':[106.93126031648,27.699961377076],
				            '铜仁':[109.16855802826,27.674902690624],
				            '黔西南布依族苗族':[104.90055779825,25.095148055927],
				            '毕节':[105.33332337117,27.408562131331],
				            '安顺':[105.92826996576,26.228594577737],
				            '黔东南苗族侗族':[107.98535257274,26.583991766542],
				            '黔南布依族苗族':[107.52320511006,26.264535997442],
				            '云南':[101.59295163701,24.864212795483],
				            '昆明':[102.71460113878,25.049153100453],
				            '昭通':[103.72502065573,27.340632963635],
				            '曲靖':[103.78253888803,25.520758142871],
				            '楚雄彝族':[101.32863799918,24.880252472651],
				            '玉溪':[102.54506789248,24.370447134438],
				            '红河哈尼族彝族':[103.38406475716,23.367717516499],
				            '文山壮族苗族':[104.24629431757,23.37408685041],
				            '普洱':[100.98005773013,22.788777780149],
				            '西双版纳傣族':[100.80303827521,22.009433002236],
				            '大理白族':[100.21920895422,25.693966622473],
				            '保山':[99.177995613278,25.12048919619],
				            '德宏傣族景颇族':[98.589434287407,24.441239663008],
				            '丽江':[100.22962839888,26.875351089481],
				            '怒江傈僳族':[98.859932042482,25.860676978165],
				            '迪庆藏族':[99.713681598883,27.831029461167],
				            '临沧':[100.09261291373,23.887806103773],
				            '西藏':[89.137981684031,31.367315402715],
				            '拉萨':[91.111890895984,29.662557062057],
				            '昌都':[97.185581579976,31.140575631882],
				            '山南':[91.750643874412,29.229026931718],
				            '日喀则':[88.956062773518,29.268160032655],
				            '那曲':[92.067018368859,31.48067983012],
				            '阿里':[81.10766868949,30.404556588325],
				            '林芝':[94.349985458244,29.666940625813],
				            '陕西':[109.50378929073,35.860026261323],
				            '西安':[129.58492424063,44.491714149262],
				            '铜川':[108.9680670134,34.908367696384],
				            '宝鸡':[107.17064545238,34.364080809748],
				            '咸阳':[108.7075092782,34.345372995999],
				            '渭南':[109.48393269658,34.502357975829],
				            '汉中':[107.04547762873,33.081568978158],
				            '安康':[109.03804456348,32.704370449994],
				            '商洛':[109.9342081538,33.873907395085],
				            '延安':[109.50050975697,36.60332035226],
				            '榆林':[109.74592574433,38.279439240071],
				            '甘肃':[102.45762459934,38.103267343752],
				            '兰州':[103.82330544073,36.064225525043],
				            '嘉峪关':[98.281634585257,39.802397326734],
				            '金昌':[102.20812626259,38.516071799532],
				            '白银':[104.2056493285,36.50182182871],
				            '天水':[105.73693162286,34.584319418869],
				            '酒泉':[98.508414506167,39.741473768159],
				            '张掖':[100.45989186892,38.939320296982],
				            '武威':[102.64014734337,37.933172142906],
				            '定西':[104.62663760066,35.586056241828],
				            '陇南':[104.93457340575,33.394479972938],
				            '平凉':[106.68891115655,35.550110190017],
				            '庆阳':[107.64422708673,35.72680075453],
				            '临夏回族':[103.2005757611,35.585834814564],
				            '甘南藏族':[102.9174424865,34.992211178379],
				            '青海':[96.202543672261,35.499761004275],
				            '西宁':[101.7679209898,36.640738611958],
				            '海东':[102.08520698745,36.517610167686],
				            '海北藏族':[100.87980217448,36.960654101084],
				            '黄南藏族':[102.00760030834,35.522851551728],
				            '海南藏族':[106.92539717866,39.296209479392],
				            '果洛藏族':[100.22372276899,34.48048458461],
				            '玉树藏族':[97.013316137414,33.006239909722],
				            '海西蒙古族藏族':[97.342625415333,37.37379907059],
				            '宁夏':[106.15548126505,37.321323112295],
				            '银川':[106.20647860784,38.502621011876],
				            '石嘴山':[106.37933720153,39.020223283603],
				            '吴忠':[106.20825419851,37.993561002936],
				            '固原':[106.28526799598,36.021523480709],
				            '中卫':[105.19675419936,37.521124191595],
				            '新疆':[126.63770727987,45.611746712731],
				            '乌鲁木齐':[87.564987741116,43.840380347218],
				            '克拉玛依':[84.926989634948,45.203919246039],
				            '吐鲁番':[89.266025488642,42.678924820794],
				            '哈密':[93.529373012389,42.344467104552],
				            '昌吉回族':[87.073618053225,44.175083447891],
				            '博尔塔拉蒙古族':[82.052436267224,44.913651374298],
				            '巴音郭楞蒙古族':[86.121688362984,41.771362202569],
				            '阿克苏':[81.156013147807,40.349444301113],
				            '克孜勒苏柯尔克孜':[76.137564477462,39.750345577845],
				            '喀什':[76.014342798943,39.513110585312],
				            '和田':[79.915813731039,37.153349739681],
				            '伊犁哈萨克':[81.297853530366,43.922248096341],
				            '塔城':[83.190127663082,46.811367143719],
				            '阿勒泰':[87.926214360189,47.890135725749],
				            '香港': [114.10000,22.20000], 
				            '澳门': [113.35,22.14],
				            '台湾': [121.5365,25.0192]
						}
					}, {
						name : '上海商旅',
						type : 'map',
						mapType : 'china',
						data : [],
						markLine : {
							smooth : true,
							effect : {
								show : true,
								size : 3,
								shadowColor : 'aqua'
							},
							itemStyle : {
								normal : {
									borderWidth : 1
								}
							},
						data : markLineData
				        },
						markPoint : {
							symbol : 'emptyCircle',
							symbolSize : function(v) {
								return 10 + v/10
							},
							effect : {
								show : true,
								shadowBlur : 0
							},
							itemStyle : {
								normal : {
									label : {
										show : false
									}
								}
							},
							data : markPointData
				            }
				        }
				    ]
				};
			
			mmChart.setOption(mmOption);
		});
	}
	
	/* function clearText(){
		document.getElementById("cardNum").value = "";
	}

	function resText(){
		var domObj = document.getElementById("cardNum");
		if(domObj.value==""){
			domObj.value = "请输入银行卡号";
		}
	}  */
	
	function setCardImg() {
		switch (cardLvl) {
		case 0:
		case 1:
		case 2:
		{
			document.images.cardImg.src = "<%=context%>/resources/img/card/pk_trvl.png";
			break;
		}
		case 3:
		{
			document.images.cardImg.src = "<%=context%>/resources/img/card/jk_trvl.png";
			break;
		}
		case 4:
		{
			document.images.cardImg.src = "<%=context%>/resources/img/card/bj_trvl.png";
			break;
		}
		case 5:		
		case 6:
		{
			document.images.cardImg.src = "<%=context%>/resources/img/card/zs_trvl.png";
			break;
		}
		}
	}
	
	function setCardTxt() {
		switch (cardLvl) {
		case 0:
		{
			document.getElementById("cardTxt").innerHTML = '';
			break;			
		}
		case 1:
		{
			document.getElementById("cardTxt").innerHTML = '普卡';
			break;		
		}
		case 2:
		{
			document.getElementById("cardTxt").innerHTML = '银卡';
			break;
		}
		case 3:
		{
			document.getElementById("cardTxt").innerHTML = '金卡';
			break;
		}
		case 4:
		{
			document.getElementById("cardTxt").innerHTML = '白金卡';
			break;
		}
		case 5:
		{
			document.getElementById("cardTxt").innerHTML = '钻石卡';
			break;
		}
		case 6:
		{
			document.getElementById("cardTxt").innerHTML = '无限卡';
			break;
		}
		}
	}
	
	$(document).ready(function(){
		  $("#cardNum").click(function(){
			  getCardNum();
		  });
		});
		
	function getCardNum(){
		$.ajax({
			type: "post",
			url : "/CardHolder/CardNum",
			method:"getCardNum",
			success: function(json){
				//alert(json);
				if(json==00) {
					$('#cardNum').val(""); 
					alert("没有检测到IC银行卡，请插卡或输入银行卡号！");
				} else if(json==01) {
					alert("此IC银行卡为非标准IC银行卡!");
				} else {
					$('#cardNum').val(json); 
				}
				
			},
			error: function (msg) {
				$('#cardNum').val(""); 
	            alert("请插卡或输入银行卡号");
	        }
		})
	}; 
</script>

</head>

<body onload="load()" style="background: none">
	<form name="myform" method="post" action="/CardHolder/TravelServlet">
		<div class="qj_box">
			<div class="search_box">
				<select id="yearSelect" name="yearSelect" class="sl">
					<option value="2012">2012</option>
					<option value="2013" selected>2013</option>
					<option value="2014">2014</option>
				</select> <input id="cardNum" name="cardNum" type="text" value="请插卡或输入银行卡号" />
				<input name="submit" type="submit" value="查询" />
			</div>
			<div id="shanglv_box" class="shanglv_box" style="display:none">
				<div class="zhangdan_title">
					<strong>商旅</strong><span id="yearSpan"></span>
				</div>
				<div class="shanglv_nr">
					<div class="shanglv_nr_title">
						<img id="cardImg" src="" align="absmiddle" /><span id="cardTxt"></span>
					</div>
					<table width="100%" border="0" cellspacing="0" cellpadding="0"
						class="pingfen">
						<!--商旅评分开始-->
						<tr>
							<td width="83" class="font_title">商旅评分</td>
							<td width="177">商旅价值：<strong id="trvlVal"></strong></td>
						</tr>
						<tr>
							<td rowspan="3"><img src="<%=context%>/resources/img/sl_img01.png" /></td>
							<td>全国排名前<strong id="trvlRank"></strong></td>
						</tr>
						<tr>
							<td>击败<strong id="trvlBtNum"></strong></td>
						</tr>
						<tr>
							<td><div class="bingtu">
									<a href="javascript:void(0)" onclick="openRank()"><img
										src="<%=context%>/resources/img/sl_img06.png" /></a>
								</div></td>
						</tr>
					</table>
					<!--商旅评分结束-->

					<table width="100%" border="0" cellspacing="0" cellpadding="0"
						class="jiaoyi">
						<!--商旅交易开始-->
						<tr>
							<td width="77" class="font_title">商旅交易</td>
							<td width="183">商旅频次：<strong id="trvlTransTimes"></strong></td>
						</tr>
						<tr>
							<td rowspan="3"><img src="<%=context%>/resources/img/sl_img04.png" /></td>
							<td>商旅消费：<strong id="trvlTransSum"></strong></td>
						</tr>
						<tr>
							<td>境外商旅：<strong id="crossTrvlTimes"></strong></td>
						</tr>
						<tr>
							<td><div class="bingtu">
									<a href="javascript:void(0)" onclick="openTrade()"><img
										src="<%=context%>/resources/img/sl_img05.png" /></a>
								</div></td>
						</tr>
					</table>
					<!--商旅交易结束-->
					<table width="100%" border="0" cellspacing="0" cellpadding="0"
						class="dengji">
						<!--住宿等级开始-->
						<tr>
							<td width="77" class="font_title">住宿等级</td>
							<td width="183">酒店档次：<strong id="htlLvl"></strong></td>
						</tr>
						<tr>
							<td rowspan="3"><img src="<%=context%>/resources/img/sl_img02.png" /></td>
							<td>酒店频次：<strong id="htlTimes"></strong></td>
						</tr>
						<tr>
							<td>酒店消费：<strong id="htlSum"></strong></td>
						</tr>
						<tr>
							<td>酒店忠诚度：<strong id="htlLoyalty"></strong></td>
						</tr>
					</table>
					<!--住宿等级结束-->
					<table width="100%" border="0" cellspacing="0" cellpadding="0"
						class="xinxi">
						<!--多元化信息开始-->
						<tr>
							<td width="94" class="font_title">多元化信息</td>
							<td width="166">交易城市：<strong id="cityNum"></strong></td>
						</tr>
						<tr>
							<td rowspan="4"><img src="<%=context%>/resources/img/sl_img03.png" /></td>
							<td>交易省份：<strong id="provinceNum"></strong></td>
						</tr>
						<tr>
							<td>境外交易：<strong id="crossTimes"></strong></td>
						</tr>
						<tr>
							<td>境外消费：<strong id="crossSum"></strong></td>
						</tr>
						<tr>
							<td>常去境外地区：<strong id="crossAreaNm"></strong></td>
						</tr>
					</table>
					<!--多元化信息结束-->
					<div id="trvlLvlNm" class="sl_bq"></div>
				</div>
				<div id="mchntMigrate" style="height: 450px; width:750px; margin: 35px;" class="shanglv_nr02"></div>
			</div>
		</div>
	</form>
</body>
</html>
