package com.cup.cardholder.model;

import java.util.HashMap;
import java.util.Iterator;
import java.util.Map;
import java.util.Map.Entry;

import com.cup.cardholder.service.StringUtil;

public class HashMaps {
	/**
	 * 交易代码
	 */
	private String[] transIds = { "C00", "C01", "C02", "C22", "C23", "C52",
			"D00", "D01", "D09", "D10", "D14", "D22", "D23", "D24", "D28",
			"D30", "D31", "D52", "D54", "D60", "D61", "D70", "D71", "D72",
			"D75", "D76", "D80", "D90", "D91", "E00", "E01", "E02", "E03",
			"E04", "E05", "E06", "E07", "E08", "E09", "E10", "E11", "E12",
			"E13", "E14", "E15", "E16", "E17", "E20", "E22", "E23", "E24",
			"E25", "E26", "E27", "E28", "E29", "E30", "E31", "E32", "E33",
			"E34", "E35", "E36", "E37", "E38", "E39", "E40", "E41", "E42",
			"E43", "E44", "E45", "E46", "E47", "E48", "E49", "E50", "E51",
			"E63", "E64", "E65", "E66", "E70", "E71", "E72", "E73", "E74",
			"E80", "E81", "E84", "F20", "F22", "F23", "F24", "F25", "F28",
			"F29", "F30", "F31", "F32", "F47", "F53", "F63", "F65", "F66",
			"F73", "F74", "F80", "F81", "G23", "I00", "I01", "I01", "I02",
			"I03", "I04", "I05", "I20", "I20", "I22", "I22", "I52", "I60",
			"I60", "I60", "I61", "I61", "I62", "I62", "I62", "I63", "I63",
			"I64", "I64", "I64", "I65", "I65", "I66", "I66", "I66", "I67",
			"I68", "M00", "M01", "M02", "M02", "M02", "M02", "M03", "M03",
			"M03", "M04", "M04", "M04", "M05", "M05", "M05", "M06", "M06",
			"M06", "M07", "M07", "M07", "M08", "M08", "M08", "M10", "M11",
			"M12", "M13", "M14", "M15", "M16", "M17", "M18", "M30", "M31",
			"M41", "M42", "M43", "M44", "M45", "M50", "M51", "M52", "M53",
			"M61", "M62", "M63", "M64", "M65", "M66", "M70", "M71", "M72",
			"M73", "M80", "M81", "M82", "M83", "N01", "N01", "N02", "N03",
			"N03", "N04", "N05", "N06", "N07", "N08", "N09", "N09", "N10",
			"N10", "N11", "N12", "N13", "N14", "N15", "N16", "N17", "N17",
			"N17", "N18", "N19", "N19", "N20", "N21", "N22", "N22", "N23",
			"N23", "N24", "N24", "N24", "N26", "N26", "N26", "N27", "N28",
			"N29", "N30", "N31", "N32", "N33", "N34", "N35", "N36", "N37",
			"N40", "N41", "N42", "N43", "N44", "N45", "N46", "N47", "N48",
			"N49", "N50", "N51", "N52", "P00", "P01", "P02", "P03", "P04",
			"P05", "P06", "P07", "P08", "P09", "P10", "P11", "P11", "P12",
			"P13", "P13", "P14", "P14", "P15", "P16", "P17", "P18", "P41",
			"P42", "P43", "P44", "P45", "P46", "P47", "P50", "P51", "P52",
			"P53", "P54", "Q01", "Q02", "Q03", "Q04", "Q05", "Q06", "Q06",
			"Q07", "Q07", "Q08", "Q09", "Q10", "Q11", "Q12", "Q13", "Q14",
			"Q15", "Q16", "Q17", "Q18", "Q19", "Q20", "Q21", "Q22", "Q23",
			"Q24", "Q25", "Q26", "Q27", "Q28", "Q29", "Q30", "Q31", "Q32",
			"Q33", "Q34", "Q35", "Q36", "Q37", "Q38", "Q39", "Q40", "Q41",
			"Q42", "Q43", "Q44", "Q45", "Q46", "Q47", "Q48", "Q49", "Q50",
			"Q51", "Q52", "Q53", "Q54", "Q55", "Q56", "Q57", "Q58", "Q59",
			"Q60", "Q61", "Q62", "Q63", "Q64", "Q65", "Q66", "Q67", "Q68",
			"Q69", "Q70", "Q72", "Q73", "Q74", "Q75", "Q76", "Q77", "Q78",
			"Q79", "Q80", "Q81", "Q82", "Q83", "Q84", "Q85", "Q86", "Q87",
			"Q88", "Q89", "Q90", "Q95", "R03", "R03", "R09", "R09", "R10",
			"R10", "R11", "R12", "R13", "R14", "R15", "R17", "R18", "R18",
			"R20", "R22", "R23", "R24", "R25", "R26", "R27", "R28", "R31",
			"R36", "R37", "R40", "R42", "R45", "R46", "R48", "R49", "R50",
			"R52", "R54", "R57", "R58", "R59", "R61", "R62", "R63", "R68",
			"R70", "R74", "R76", "R78", "R79", "R84", "R89", "S00", "S00",
			"S01", "S02", "S02", "S03", "S03", "S04", "S05", "S06", "S07",
			"S08", "S09", "S09", "S10", "S10", "S11", "S12", "S13", "S14",
			"S15", "S16", "S17", "S17", "S18", "S18", "S19", "S20", "S20",
			"S21", "S21", "S22", "S23", "S23", "S24", "S24", "S25", "S25",
			"S26", "S27", "S28", "S28", "S29", "S30", "S30", "S31", "S31",
			"S32", "S33", "S34", "S35", "S35", "S35", "S36", "S37", "S38",
			"S40", "S41", "S46", "S47", "S48", "S49", "S50", "S54", "S59",
			"S60", "S70", "S80", "S81", "S82", "S90", "S92", "S93", "S95",
			"T00", "T01", "T02", "T10", "T11", "T12", "T20", "T21", "T30",
			"U01", "U02", "U03", "U04", "U05", "U06", "U07", "U08", "U09",
			"U10", "U11", "U12", "U13", "U14", "U15", "U16", "U17", "U18",
			"U19", "U20", "U21", "U21", "U22", "U22", "U23", "U24", "U25",
			"U26", "U27", "U28", "U29", "U30", "U31", "U32", "U33", "U34",
			"U35", "U36", "U37", "U38", "U39", "U40", "U41", "U42", "U43",
			"U44", "U45", "U46", "U47", "U48", "U49", "U50", "U51", "U57",
			"U58", "U59", "U60", "U61", "U62", "U63", "U64", "U65", "U66",
			"U67", "U68", "U69", "U70", "U71", "U72", "U73", "U74", "U77",
			"U91", "U92", "V13", "V40", "V40", "V41", "V42", "V43", "V44",
			"V50", "V50", "V51", "V52", "V53", "V54", "V57", "V58", "V61",
			"V62", "V63", "V68", "V68", "V76", "V78", "V79", "V81", "V84",
			"V93", "V94", "X01", "X02", "X22", "X52" };
	/**
	 * 交易名称
	 */
	private String[] transNms = { "增值服务查询", "实时送分", "商户代理积分消费", "增值服务消费",
			"票券消费", "增值服务积分消费撤销", "余额查询（双）", "明细查询（双）", "批扣请求", "对外卡组织的人工索权",
			"柜面取现人工索权/授权补录", "文件结算（双）", "批扣应答", "文件取现（双）", "外卡交易种类（非自主清算明细）",
			"文件退货（双）", "批付请求", "文件结算撤销（双）", "文件取现撤销（双）", "文件退货撤销（双）", "批付拒绝",
			"离线结算-电话授权", "离线结算-代授权", "结算调整-金额调整", "结算调整-小费", "离线结算-POS预授权",
			"手工预授权完成（双）", "MC/BankNet拒绝承认01", "批付再拒绝", "差错-查询", "查询（受理方提出）",
			"差错-查复", "查复（受理方提出查询）", "差错-调单", "差错-调单回复", "单边帐通知", "单边帐回复",
			"没收卡片登记", "没收卡片回复", "发起方发起争议请求/中心生成争议通知", "接收方回复争议通知/中心生成争议结果",
			"带调单的查询（发卡方提出）", "带调单的查复", "差错-受理向转出查询", "差错-转出向受理查复",
			"差错-受理向转入查询", "差错-转入向受理查复", "差错-收费", "差错-请款", "差错-结算的退单",
			"差错-结算再请款", "差错-结算二次退单", "差错例外协商", "差错例外协商回复", "差错-退货的退单",
			"差错-退货再请款", "差错-付费", "差错-差错例外-贷", "内卡差错交易（自主清算差错明细）交易种类",
			"差错-一般转帐转入贷记调整", "差错-一般转帐转出贷记调整", "差错-一般转帐转入对贷调请款", "差错-一般转帐转出请款",
			"差错-转入转帐贷记调整", "转出转帐贷记调整", "差错-转入转帐对贷调请款", "MC/MDS调整-受理方",
			"MC/MDS退单-受理方", "MC/MDS再请款-受理方", "MDS调整-发卡方", "MDS退单-发卡方",
			"MDS再请款-发卡方", "外卡托收", "差错-退货二次退单", "外卡-预仲裁", "外卡-仲裁", "外卡-预依从",
			"外卡-依从", "差错-PBOC转帐圈存贷记调整（转入）", "差错-PBOC转帐圈存贷记调整（转出）",
			"差错-PBOC现金充值贷记调整", "差错-PBOC圈存贷记调整", "差错-转出转帐请款", "差错-受理向转入查询",
			"差错-转出向受理查复", "差错例外-贷(发卡方)", "退货（手工）", "差错-发卡-存款的贷记调整",
			"差错-发卡-存款的请款", "退货（手工单）", "差错-受理-收费", "差错-受理-请款", "差错-受理-退单",
			"差错-受理-再请款", "差错-受理-二次退单", "差错-受理-退货的退单", "差错-受理-退货再请款",
			"差错-受理-付费", "差错-受理-差错例外-贷", "差错-受理-贷记调整", "差错-受理-退货二次退单",
			"差错-受理-退单", "差错-PBOC转帐圈存贷记调整", "差错-PBOC现金充值贷记调整", "差错-PBOC圈存贷记调整",
			"差错-受理-差错例外-贷-发卡方", "差错-受理-手工退货", "差错-受理-存款的贷记调整", "差错-受理-存款的请款",
			"管理类退单", "IC卡信息传递", "基于PBOC借/贷记标准脚本处理结果通知", "IC卡发卡方脚本结果",
			"电话IC卡交易信息上送", "圈存确认（文件）", "PBOC转帐圈存确认（文件）", "PBOC现金充值确认（文件）",
			"基于PBOC电子钱包标准脱机消费", "PBOC脱机消费", "基于PBOC借/贷记标准电子现金脱机消费", "IC卡脱机消费",
			"IC卡脱机消费撤消", "电子现金指定账户圈存", "基于PBOC借/贷记标准电子现金指定帐户圈存", "电子现金圈存",
			"基于PBOC借/贷记电子现金指定帐户圈存冲正", "电子现金圈存冲正", "电子现金非指定账户圈存",
			"基于PBOC借/贷记电子现金非指定帐户圈存", "电子现金转账圈存", "PBOC借/贷记电子现金非指定账户圈存冲正",
			"电子现金转账圈存冲正", "现金充值", "基于PBOC借/贷记标准电子现金现金充值", "电子现金现金充值",
			"基于PBOC借/贷记标准电子现金现金充值冲正", "电子现金现金充值冲正", "脚本通知",
			"电子现金非指定帐户圈存脚本处理结果通知", "电子现金非指定圈存发卡方脚本结果", "人工预授权NO0010",
			"人工预授权冲正RV0018", "机构-银联的文字", "银联-机构的文字", "CUPA发起_签到", "CUPA_签到",
			"机构-银联签到", "向转接机构签到（主动）", "CUPA_签退", "机构-银联签退", "向转接机构签退（主动）",
			"CUP_日切开始", "开始日切", "日切开始通知", "CUP_日切结束", "终止日切", "日切结束通知",
			"CUP_线路测试", "线路测试", "线路测试（CUPS到平台）", "CUPA_重置密钥申请", "机构-银联申请重置密钥",
			"申请重置密钥（转接）", "CUP_密钥重置交易", "银联-机构重置密钥", "密钥重置请求（转接）", "机构-银联申请对帐",
			"A类对帐", "B类对帐", "C类对帐", "D类对帐", "E类对帐", "F类对帐", "G类对帐", "H类对帐",
			"银联-机构资金结算", "外卡组织向银联资金结", "银联发往AE的对帐", "VISA/SMS主动对帐",
			"VISA/SMS对帐", "MC/MDS向发卡行对帐", "MC/MDS向受理行对帐", "外卡组织-银联文字",
			"银联-外卡组织文字", "向外卡组织签到", "向外卡组织签退", "VISA/SI模式开", "VISA/SI模式关",
			"VISA/通知恢复开", "VISA/通知恢复关", "MC/SAF开始", "MC/SAF结束", "向外卡组织申请密钥",
			"VISA/SMS对CUPS重置密钥", "MC/MDS对CUPS重置密钥", "MC/MDS重置密钥结束通知",
			"国内机构上送风险卡", "银联下发风险卡", "涉嫌卡通知", "涉嫌卡交易通知", "POS签到", "终端签到",
			"第三方机构签到", "POS签退", "终端签退", "第三方机构签退", "传定制用户资料", "传交易明细",
			"取缴费号码销户文件", "收银员签到", "POS终端回响测试", "终端回响测试",
			"基于PBOC电子钱包标准圈存批上送通知交易", "基于PBOC电子钱包标准IC卡圈存批结处理原则",
			"基于PBOC借/贷记IC卡批结处理原则", "批结算", "批上送通知(退货)", "批上送通知(完成离线)",
			"批上送通知(结算调整)", "批上送通知(离线结算)", "CUPA_线路测试", "机构线路测试",
			"线路测试（平台到CUPS）", "批上送金融交易", "上传TC", "批上送通知交易(成功的IC卡联机交易明细)",
			"批上送结束", "POS状态上送", "下载结束通知", "IC卡公钥/参数/TMS参数下载结束", "下载TMS",
			"POS参数传递", "CUP_打开机构", "银联打开机构", "打开机构（被动）", "CUP_关闭机构", "银联关闭机构",
			"关闭机构（被动）", "批上送通知(小费)", "批上送金融交易(电子钱包脱机消费)", "批上送金融交易(电子现金脱机消费)",
			"申请重置密钥（接入）", "密钥重置请求（接入）", "传定制用户资料", "传交易明细", "取缴费号码销户文件",
			"线路测试（商户到平台）", "线路测试（平台到商户）", "动态密码生成", "查询公钥", "下载公钥", "查询AID",
			"下载AID", "批上送通知交易(失败的IC卡交易-ARPC错)", "批上送通知交易(失败的IC卡交易-脱机消费)",
			"POS电子凭条上送", "批上送通知交易（MOTO退货）", "批上送通知交易（MOTO完成离线）", "IC卡增值应用信息上送",
			"CUPA_重置密钥(电话业务间联机构)", "电话业务间联机构重置密钥申请", "电话业务直连终端菜单更新", "现金缴费",
			"现金缴费冲正", "行业划款出账", "行业划款出账冲正", "行业划款出账撤销", "行业划款出账撤销冲正", "行业划款进账",
			"行业划款进账确认", "行业划款进账撤销", "行业划款进账撤销冲正", "公务划款受理", "公务划款转出", "公务划款出账",
			"公务划款出账冲正", "公务划款转入", "公务划款进账", "公务划款转入确认", "公务划款进账确认", "账户还款",
			"账户还款冲正", "票据打印", "票据打印冲正", "建立委托关系", "建立委托关系冲正", "变更委托关系",
			"变更委托关系冲正", "撤销委托关系", "撤销委托关系冲正", "查询委托关系", "账户验证(公共支付)", "行业费用查询",
			"行业信息查询", "金融信息通知", "帐户交易明细查询", "建立主动定向委托关系", "建立委托商户委托关系",
			"建立自助还款委托关系", "建立贷款还款委托关系", "建立非定向委托关系", "建立提醒服务号码与支付账户号码委托关系",
			"建立提醒委托关系-支付账户号码", "建立提醒服务号码与用户号码委托关系", "建立提醒委托关系-用户号码",
			"建立终端转帐委托关系", "建立用户号码与支付账户号码关联关系", "撤销主动定向委托关系", "撤销委托商户委托关系",
			"撤销自助还款委托关系", "撤销贷款还款委托关系", "撤销非定向委托关系", "撤销提醒服务号码与支付账户号码委托关系",
			"撤销提醒服务号码与用户号码委托关系", "撤销终端转帐委托关系", "撤销用户号码与支付账户号码关联关系",
			"取消支付号码相关的所有委托关系", "取消银行卡号相关的所有委托关系", "取消银行卡和支付号码相关的所有委托关系",
			"变更委托关系（商户发起用户号变更）", "变更委托关系（终端发起银行卡号变更）", "增定委托关系", "重定委托关系",
			"修改委托支付密码", "重置委托支付密码", "根据支付号码查询支付委托关系", "根据支付账户号码查询支付委托关系",
			"根据用户号码查询支付委托关系", "根据提醒号码查询提醒委托关系", "根据支付账户号码查询提醒委托关系",
			"根据用户号码查询提醒委托关系", "用户号码与支付账户号码关联关系查询", "行业账单查询", "行业信息查询",
			"支付类委托关系帐户交易明细查询", "提醒类委托关系帐户交易明细查询", "支付委托关系查询银行卡余额查询",
			"提醒委托关系查询银行卡余额查询", "金融信息通知", "存款通知", "票据打印", "帐户验证", "建立支付类主动委托关系",
			"建立支付类委托商户委托关系", "建立支付类非定向委托关系", "建立支付类自助还款委托关系", "建立支付类贷款还款委托关系",
			"撤销支付类主动委托关系", "撤销支付类委托商户委托关系", "撤销支付类非定向委托关系", "撤销支付类自助还款委托关系",
			"撤销支付类贷款还款委托关系", "重建支付类主动委托关系", "重建支付类委托商户委托关系", "重建支付类非定向委托关系",
			"重建支付类自助还款委托关系", "重建支付类贷款还款委托关系", "建立提醒类委托关系", "撤销提醒类委托关系",
			"重建提醒类委托关系", "取消所有委托关系-支付号码和用户号码", "支付帐户号码变更委托关系（柜面）",
			"委托关系手工调整-建立提醒类-用户号码", "委托关系手工调整-撤销提醒类-用户号码",
			"委托关系手工调整-重建提醒类-用户号码", "缴费撤销", "代付撤销", "销账交易", "建立终端定制委托关系",
			"撤销终端定制委托关系", "消费（传统）", "建立主动定向委托关系冲正", "建立委托商户委托关系冲正",
			"建立自助还款委托关系冲正", "建立贷款还款委托关系冲正", "建立非定向委托关系冲正", "建立提醒委托关系-支付账户号码冲正",
			"建立提醒委托关系-用户号码冲正", "撤销主动定向委托关系冲正", "撤销委托商户委托关系冲正", "撤销自助还款委托关系冲正",
			"撤销贷款还款委托关系冲正", "撤销非定向委托关系冲正", "撤销提醒委托关系-支付账户号码冲正",
			"撤销提醒委托关系-用户号码冲正", "用户号码变更委托关系冲正", "支付账户号码变更委托关系冲正", "消费撤销（传统）",
			"基于PBOC电子钱包标准指定账户圈存冲正", "圈存冲正", "基于PBOC电子钱包标准非指定账户圈存冲正",
			"PBOC转账圈存冲正", "预授权/授权冲正", "预授权冲正", "对JCB人工索权的冲正", "追加预授权冲正",
			"分期付款消费冲正", "双-取现冲正", "PBOC转账圈存转出冲正", "分期付款消费撤销冲正",
			"基于PBOC电子钱包标准现金充值冲正", "PBOC现金充值冲正", "预授权完成冲正", "消费冲正", "代收冲正",
			"取现冲正", "一般转出转账冲正", "转出转账冲正", "MDS/ATM购物冲正", "POSCashAdvance冲正",
			"代付冲正", "积分消费冲正", "联盟积分消费冲正", "预授权撤销冲正", "授权冲撤(内部冲正）",
			"电话平台直连终端冲正", "MOTO消费冲正RV0008", "MOTO预授权冲正RV0010",
			"MOTO预授权完成冲正RV0012", "预授权完成撤销冲正", "消费撤销冲正", "消费冲正(预约消费)",
			"联盟积分消费撤销冲正", "POSCashAdvance撤销冲正", "助农取款冲正", "代付撤销冲正", "存款撤销冲正",
			"积分消费撤销冲正", "PBOC借贷记IC卡电子现金现金充值撤销冲正", "手机预约助农取款冲正", "SMS取现冲正受理方",
			"MOTO消费撤销冲正RV0009", "MOTO预授权撤销冲正RV0011", "MOTO预授权完成撤销冲正RV0013",
			"消费撤消冲正(预约消费)", "SMS冲正受理方", "余额查询", "银行卡查询余额", "明细查询", "转账",
			"一般转账", "基于PBOC电子钱包标准指定账户圈存", "圈存", "圈提", "圈提确认", "建立委托关系",
			"撤销委托关系", "修改密码", "基于PBOC电子钱包标准非指定账户圈存", "PBOC转账圈存", "预授权/授权",
			"预授权", "MOTO预授权", "追加预授权", "分期付款消费", "帐户验证(银联通汇款)", "PBOC转账圈存转出",
			"PBOC转账圈存转入", "预付费卡账户验证NO0005", "预付费卡账户验证", "基于PBOC电子钱包标准现金充值",
			"PBOC现金充值", "银行卡信息下载", "预授权完成（联机）", "预授权完成", "结算通知（中心发）",
			"MOTO预授权完成（请求）", "消费", "代收", "MOTO消费", "取现", "预授权完成（通知）", "一般转账转出",
			"MOTO预授权完成（通知）", "转出转账", "MDS/ATM购物", "银联通汇款(联机)", "汇款",
			"发卡MDS预授权完成", "退货", "联机退货", "代付", "MOTO退货", "存款", "一般转账转入", "转入转账",
			"预授权完成（通知）", "预授权结算（机构发）", "预授权完成（离线）", "积分消费", "联盟积分消费",
			"联盟积分余额查询", "预付费卡现金充值NO0006", "预付费卡账户充值NO0007", "MOTO消费NO0008",
			"MOTO退货RT0003", "MOTO预授权NO0009", "MOTO预授权完成(联机)PR0003",
			"MOTO预授权完成(离线)PR0004", "消费(预约消费)", "助农取款", "脱机消费退货", "手机预约助农取款",
			"预授权完成（手工）", "预授权完成（手工单）", "银联通汇款(手工)", "MC/MDS拒绝承认0290", "存款确认",
			"一般转入转帐确认", "预付费卡充值确认CO0001", "票券查询", "票券承兑", "终止代授权通知的获取",
			"预授权/授权的代授权通知", "冲正交易的代授权通知", "撤销交易的代授权通知", "消费/取现代授权通知",
			"预授权完成/预授权结算通知的代授权通知", "VISA发起的代授权通知", "缴费", "缴费撤销", "充值", "充值撤销",
			"代收现金", "代收现金撤销", "单笔代收", "单笔代收撤销", "行业划款出账", "行业划款出账撤销", "行业划款进账",
			"行业划款进帐撤销", "行业划款进帐确认", "购买电子产品", "购买电子产品撤销", "现金缴费", "代付", "代付撤销",
			"代付确认", "卡卡转账", "公务卡转出", "从公务卡转出", "公务卡转入", "转入公务卡", "缴费退款",
			"充值退款", "代收现金退款", "单笔代收退款", "行业划款出账退款", "购买电子产品退款", "扣费", "账户还款",
			"行业划款进账", "委托关系撤销", "账户验证", "短信发送", "金融信息通知", "联机对账通知", "账单缴费",
			"账单缴费冲正", "账单缴费撤销", "账单缴费撤销冲正", "票据打印冲正", "购买电子产品冲正", "购买电子产品撤销",
			"购买电子产品撤销冲正", "购买电子产品冻结", "购买电子产品冻结冲正", "票据打印", "票据打印冲正", "账单费用查询",
			"购买电子产品", "信用卡还款", "实时代付", "实时代付撤销", "实时代付确认", "缴费冲正", "缴费撤销冲正",
			"充值冲正", "充值撤销冲正", "代收现金冲正", "代收现金撤销冲正", "单笔代收冲正", "单笔代收撤销冲正",
			"行业划款出帐冲正", "行业划款出帐撤销冲正", "行业划款进账确认冲正", "行业划款进账撤销冲正", "购买电子产品冲正",
			"购买电子产品撤销冲正", "现金缴费冲正", "脱机消费", "账户还款冲正", "定制转账", "分期付款消费撤销",
			"预授权/授权撤消", "预授权撤销", "MOTO预授权撤销", "授权冲撤", "BASEI发起POS授权冲撤",
			"BASEI发起ATM取现授权", "预授权完成撤消", "预授权完成撤销", "MOTO预授权完成撤销", "消费撤销",
			"MOTO消费撤销", "柜面取现撤消", "联盟积分消费撤销", "POSCashAdvance撤销", "代付撤消",
			"存款撤消", "积分消费撤销", "PBOC借贷记IC卡电子现金现金充值撤销", "现金充值撤销",
			"MOTO消费撤销CA0010", "MOTO预授权撤销CA0011", "MOTO预授权完成撤销CA0012",
			"预授权完成撤销（手工）", "消费撤消(预约消费)", "BASE1POS授权冲撤通知", "BASE1ATM授权冲撤通知",
			"实时送分冲正", "商户代理积分消费冲正", "增值服务消费冲正", "增值服务积分消费撤销冲正" };
	/**
	 * 商户代码mcc
	 */
	private String[] mcc = { "5311", "7011", "5812", "5814", "9703", "5811",
			"5813", "4900", "5300", "5411", "5331", "5399", "5422", "5441",
			"5451", "5462", "5499", "5310", "5947", "5992", "5999", "5995",
			"8043", "7221", "7631", "5946", "5094", "5944", "5970", "5971",
			"5933", "5921", "5993", "5211", "5251", "5712", "5714", "5719",
			"1520", "7013", "6513", "5713", "8912", "5271", "5511", "5521",
			"5533", "5541", "5542", "5571", "5599", "7512", "7531", "7538",
			"5532", "7535", "7523", "7542", "5611", "5621", "5631", "5641",
			"5651", "5655", "5699", "5661", "5681", "5691", "5949", "5948",
			"5912", "8062", "8021", "8031", "8041", "8042", "8011", "8071",
			"8099", "5945", "8351", "8211", "8220", "7230", "7297", "7298",
			"7299", "5977", "7997", "7992", "5940", "5941", "5996", "7941",
			"5942", "5943", "7832", "7911", "7996", "7519", "7999", "7991",
			"4733", "4722", "5962", "3998", "4112", "4131", "4511", "4582",
			"4111", "4784", "4121", "5309", "9400", "6011", "6010", "6050",
			"5960", "6051", "6211", "6300", "6012", "6013", "4814", "4816",
			"4812", "5722", "5732", "5734", "0763", "7311", "7333", "7392",
			"7273", "7399", "9211", "9222", "9311", "8651", "9399", "5013",
			"5021", "5039", "5044", "5045", "5046", "5047", "5051", "5065",
			"5072", "5074", "5111", "5122", "5131", "5137", "5139", "5172",
			"5193", "5398", "4458", "5998", "9705" };
	/**
	 * 行业名称缩写
	 */
	private String[] inds = { "SC", "ZS", "CY", "CY", "CY", "CY", "YJ", "SDM",
			"RB", "RB", "RB", "RB", "RB", "RB", "RB", "RB", "RB", "RB", "RFB",
			"RFB", "RFB", "RFB", "RFB", "RFB", "RFB", "RFB", "LSC", "LSC",
			"LSC", "LSC", "LSC", "LSC", "LSC", "FC", "FC", "FC", "FC", "FC",
			"FC", "FC", "FC", "FC", "FC", "QC", "QC", "QC", "QC", "QC", "QC",
			"QC", "QC", "QC", "QC", "QC", "QC", "QC", "QC", "QC", "FZ", "FZ",
			"FZ", "FZ", "FZ", "FZ", "FZ", "FZ", "FZ", "FZ", "FZ", "FZ", "YL",
			"YL", "BYL", "BYL", "BYL", "BYL", "BYL", "BYL", "BYL", "XQ", "XQ",
			"ZXX", "DX", "MR", "MR", "MR", "MR", "MR", "GYD", "GYD", "DYD",
			"DYD", "DYD", "DYD", "WH", "WH", "XY", "XY", "XY", "XY", "XY",
			"LY", "LY", "LY", "LY", "JT", "JT", "JT", "JT", "JT", "JT", "JT",
			"JT", "MSD", "CG", "XJ", "XJ", "XJ", "JR", "JR", "JR", "JR", "JR",
			"JR", "XX", "XX", "XX", "XX", "XX", "XX", "SY", "SY", "SY", "SY",
			"SY", "SY", "ZF", "ZF", "ZF", "ZF", "ZF", "PF", "PF", "PF", "PF",
			"PF", "PF", "PF", "PF", "PF", "PF", "PF", "PF", "PF", "PF", "PF",
			"PF", "PF", "PF", "PF", "PF", "PF", "PF" };
	/**
	 * 行业英文名称
	 */
	private String[] indEng = { "SC", "ZS", "CY", "YJ", "SDM", "RB", "RFB",
			"LSC", "FC", "QC", "FZ", "YL", "BYL", "XQ", "ZXX", "DX", "NX",
			"MR", "GYD", "DYD", "WH", "XY", "LY", "JT", "MSD", "CG", "XJ",
			"JR", "XX", "SY", "ZF", "PF" };
	/**
	 * 行业中文名称
	 */
	private String[] indCh = { "商场", "住宿", "餐饮", "饮酒场所", "公共事业费", "日用必需品",
			"日用非必需品", "类奢侈消费", "房产装修", "汽车", "服装", "医疗", "补充医疗", "学前", "中小学",
			"大学", "女性", "美容", "高端运动", "大众运动", "文化", "休闲娱乐", "旅游", "交通运输",
			"免税店", "要出国", "现金业务", "金融服务", "信息服务", "商业服务", "政府服务", "批发类" };

	/**
	 * 商户迁徙哈希表
	 */
	private Map<String, String> migrateHashMap = new HashMap<String, String>();

	/**
	 * 交易哈希表
	 */
	private Map<String, String> transHashMap = createHashMap(transIds, transNms);
	/**
	 * mcc哈希表
	 */
	private Map<String, String> mccHashMap = createHashMap(mcc, inds);
	/**
	 * 行业表
	 */
	private Map<String, String> indHashMap = createHashMap(indEng, indCh);

	public void setMigrateHashMap(String str) {
		if (str == null || !str.contains(":")) {
			return;
		}

		String[] infos = str.split(",");
		for (int i = 0; i < infos.length; i++) {
			String[] tmp = infos[i].split(":");
			migrateHashMap.put(tmp[0], tmp[1]);
		}
	}

	public int getMaxTimes(Map<String,String> map) {
		int maxTimes = 0;
		Iterator iter = map.entrySet().iterator();
		int times = 0;
		while (iter.hasNext()) {
			Map.Entry entry = (Map.Entry) iter.next();
			String val =(String) entry.getValue();
			times = StringUtil.string2Int(val);
			if(maxTimes < times) {
				maxTimes = times;
			}
		}
		
		return maxTimes;
	}

	public Map<String, String> getMigrateHashMap() {
		return migrateHashMap;
	}

	public Map<String, String> getMccHashMap() {
		return mccHashMap;
	}

	public Map<String, String> getIndHashMap() {
		return indHashMap;
	}

	public Map<String, String> createHashMap(String[] keys, String[] values) {

		Map<String, String> hashMap = new HashMap<String, String>();
		int i;
		int len = keys.length;
		for (i = 0; i < len; i++) {
			hashMap.put(keys[i], values[i]);
		}

		return hashMap;
	}

	public Map<String, String> getTransHashMap() {
		return transHashMap;
	}
}
